#include <stdio.h>

long long dp[100001][3];
int main()
{	
	dp[1][0] = 1;  //1
	dp[2][0] = 0;  //1+1은 불가능하다.
	dp[2][1] = 1;  //1+2
	dp[3][0] = 1;  //2+1
	dp[3][1] = 1;  //1+2
	dp[3][2] = 1;  //3
	for (int i = 4; i < 100001; i++) {
		dp[i][0] = (dp[i - 1][1] + dp[i - 1][2]) % 1000000009; //끝에 1을 더하는 경우 -> 마지막이 2나 3으로 끝남
		dp[i][1] = (dp[i - 2][0] + dp[i - 2][2]) % 1000000009; 
		dp[i][2] = (dp[i - 3][0] + dp[i - 3][1]) % 1000000009;
	}

	int t, n;
	scanf("%d", &t);
	while (t--) {
		scanf("%d", &n);
		printf("%lld\n", (dp[n][0] + dp[n][1] + dp[n][2]) % 1000000009);
	}
}